README.md
```mermaid
---
title: E2EE sequence diagram
---
sequenceDiagram
    
    participant AxiosInterceptor as frontend: <br/>AxiosInterceptor
    participant JSON as frontend: <br/>JSON
    participant CryptoJs as frontend: <br/>CryptoJs
    participant Jsencrypt as frontend: <br/>Jsencrypt
    participant MyController as backend: <br/>MyController
    participant RestControllerAdvice as backend: <br/>With @RestControllerAdvice
    participant EncryptedResponseBodyAdvice as backend: <br/>EncryptedResponseBodyAdvice
    participant EncryptedRequestBodyAdvice as backend: <br/>EncryptedRequestBodyAdvice
    participant EncryptedBodyAdviceHelper as backend: <br/>EncryptedBodyAdviceHelper
    
    autonumber 1
    AxiosInterceptor ->> MyController: Request /v1/protected/my/public-key
    autonumber 2
    MyController -->> AxiosInterceptor: Reply `user-public-key`

    autonumber 3
    AxiosInterceptor ->> CryptoJs: Generate `aes-key` (SHA3)
    autonumber 4
    CryptoJs -->> AxiosInterceptor : Reply `aes-key`

    autonumber 5
    AxiosInterceptor ->> CryptoJs: Encrypt `original-payload-str` <br/>with `aes-key` <br/>(AES/CBC/PKCS5Padding)
    autonumber 6
    CryptoJs -->> AxiosInterceptor: Reply `aes-cbc-str`

    autonumber 7
    AxiosInterceptor ->> Jsencrypt: Encrypt `aes-key` with `user-public-key`
    autonumber 8
    Jsencrypt -->> AxiosInterceptor: Reply `aes-key-rsa`

    autonumber 9
    AxiosInterceptor ->> AxiosInterceptor: Combine `aes-cbc-str` <br/>and `aes-key-rsa` <br/>to `request-body-str`

    autonumber 10
    %% https://mermaid.js.org/syntax/sequenceDiagram.html#activations
    %% ++ / -- Shortcut syntax for activation, deactivation, creation
    AxiosInterceptor ->> +RestControllerAdvice: Send `request-body-str`

    autonumber 11
    RestControllerAdvice ->> EncryptedRequestBodyAdvice: Pass `request-body-str` to <br/>`EncryptedRequestBodyAdvice.beforeBodyRead`
    autonumber 11
    EncryptedRequestBodyAdvice ->> EncryptedBodyAdviceHelper: Split `request-body-str` into <br/>`aes-cbc-str` and `aes-key-rsa` in <br/>`RequestBodyAdviceAdapter.beforeBodyRead`

    critical Method: <br/>EncryptedBodyAdviceHelper<br/>.ecryptDataBase64ToBodyDetail 
    autonumber 12
    EncryptedBodyAdviceHelper ->> EncryptedBodyAdviceHelper: Decrypt `aes-key-rsa` <br/>by `user-private-key` <br/>to `aes-key`
    autonumber 13
    EncryptedBodyAdviceHelper -->> EncryptedBodyAdviceHelper: Reply `aes-key`

    autonumber 14
    EncryptedBodyAdviceHelper ->> EncryptedBodyAdviceHelper: Decrypt `aes-cbc-str` <br/>by `aes-key` <br/>(AES/CBC/PKCS5Padding) to <br/>`original-payload-str`
    end

    autonumber 15
    EncryptedBodyAdviceHelper ->> RestControllerAdvice: Pass `original-payload-str` to controller <br/>through the return of <br/>`RequestBodyAdviceAdapter.beforeBodyRead`

    autonumber 16
    %% ~~`aes-ecb-str`~~
    %% ~~AES/ECB/PKCS7Padding~~
    RestControllerAdvice ->> EncryptedResponseBodyAdvice: Encrypt `original-response-entity` <br/>by `aes-key` to `aes-cbc-str` <br/>(AES/CBC/PKCS7Padding)

    autonumber 17
    %% ~~`aes-ecb-str`~~
    EncryptedResponseBodyAdvice -->> RestControllerAdvice: Reply `aes-cbc-str` <br/>as response through <br/>`ResponseBodyAdvice.beforeBodyWrite`

    autonumber 18
    %% ~~`aes-ecb-str`~~
    RestControllerAdvice -->> -AxiosInterceptor: Reply `aes-cbc-str` as response

    autonumber 19
    %% ~~`aes-ecb-str`~~
    %% ~~AES/ECB/PKCS7Padding~~
    AxiosInterceptor ->> CryptoJs: Decrypt `aes-cbc-str` <br/>by `CryptoJs` (AES/CBC/PKCS7Padding) <br/>to `response-entity-str`
    autonumber 20
    CryptoJs -->> AxiosInterceptor: Reply `response-entity-str`

    autonumber 21
    AxiosInterceptor ->> JSON: Parse `response-entity-str` to <br/>`response-entity` by `JSON.parse`
    autonumber 22
    JSON -->> AxiosInterceptor: Reply `response-entity`


```
